app/controllers/school_classes_controller.rb

  def create
    @classes = SchoolClass.create(params[:school_class])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Band"], ["room_number", 300], ["created_at", "2018-07-22 22:50:04.561660"], ["updated_at", "2018-07-22 22:50:04.561660"]]

  def update
    @class = SchoolClass.find(params[:id])
    @class.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Biology"], ["room_number", 22], ["updated_at", "2018-07-24 13:54:51.364254"], ["id", 4]]